OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1788.h
extern __at(0x039F) __sfr IOCEF;

typedef struct
  {
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned IOCEF3               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __IOCEFbits_t;

extern __at(0x039F) volatile __IOCEFbits_t IOCEFbits;

#define _IOCEF3                 0x08

//==============================================================================


//==============================================================================
//        OPA1CON Bits

extern __at(0x0511) __sfr OPA1CON;

typedef union
  {
  struct
    {
    unsigned OPA1PCH0           : 1;
    unsigned OPA1PCH1           : 1;
    unsigned OPA1PCH2           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned OPA1SP             : 1;
    unsigned OPA1EN             : 1;
    };

  struct
    {
    unsigned PCH0               : 1;
    unsigned PCH1               : 1;
    unsigned PCH2               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned SP                 : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned PCH                : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned OPA1PCH            : 3;
    unsigned                    : 5;
    };
  } __OPA1CONbits_t;

extern __at(0x0511) volatile __OPA1CONbits_t OPA1CONbits;

#define _OPA1PCH0               0x01
#define _PCH0                   0x01
#define _OPA1PCH1               0x02
#define _PCH1                   0x02
#define _OPA1PCH2               0x04
#define _PCH2                   0x04
#define _OPA1SP                 0x40
#define _SP                     0x40
#define _OPA1EN                 0x80
#define _EN                     0x80

//==============================================================================


//==============================================================================
//        OPA2CON Bits

extern __at(0x0513) __sfr OPA2CON;

typedef union
  {
  struct
    {
    unsigned OPA2PCH0           : 1;
    unsigned OPA2PCH1           : 1;
    unsigned OPA2PCH2           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned OPA2SP             : 1;
    unsigned OPA2EN             : 1;
    };

  struct
    {
    unsigned PCH0               : 1;
    unsigned PCH1               : 1;
    unsigned PCH2               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned SP                 : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned PCH                : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned OPA2PCH            : 3;
    unsigned                    : 5;
    };
  } __OPA2CONbits_t;

extern __at(0x0513) volatile __OPA2CONbits_t OPA2CONbits;

#define _OPA2CON_OPA2PCH0       0x01
#define _OPA2CON_PCH0           0x01
#define _OPA2CON_OPA2PCH1       0x02
#define _OPA2CON_PCH1           0x02
#define _OPA2CON_OPA2PCH2       0x04
#define _OPA2CON_PCH2           0x04
#define _OPA2CON_OPA2SP         0x40
#define _OPA2CON_SP             0x40
#define _OPA2CON_OPA2EN         0x80
#define _OPA2CON_EN             0x80

//==============================================================================


//==============================================================================
//        CLKRCON Bits

extern __at(0x051A) __sfr CLKRCON;

typedef union
  {
  struct
    {
    unsigned CLKRDIV0           : 1;
    unsigned CLKRDIV1           : 1;
    unsigned CLKRDIV2           : 1;
    unsigned CLKRDC0            : 1;
    unsigned CLKRDC1            : 1;
    unsigned CLKRSLR            : 1;
    unsigned CLKROE             : 1;
    unsigned CLKREN             : 1;
    };

  struct
    {
    unsigned CLKRDIV            : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned                    : 3;
    unsigned CLKRDC             : 2;
    unsigned                    : 3;
    };
  } __CLKRCONbits_t;

extern __at(0x051A) volatile __CLKRCONbits_t CLKRCONbits;

#define _CLKRDIV0               0x01
#define _CLKRDIV1               0x02
#define _CLKRDIV2               0x04
#define _CLKRDC0                0x08
#define _CLKRDC1                0x10
#define _CLKRSLR                0x20
#define _CLKROE                 0x40
#define _CLKREN                 0x80

//==============================================================================


//==============================================================================
//        DAC2CON0 Bits

extern __at(0x0591) __sfr DAC2CON0;

typedef struct
  {
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned DAC2OE2              : 1;
  unsigned DAC2OE1              : 1;
  unsigned                      : 1;
  unsigned DAC2EN               : 1;
  } __DAC2CON0bits_t;

extern __at(0x0591) volatile __DAC2CON0bits_t DAC2CON0bits;

#define _DAC2OE2                0x10
#define _DAC2OE1                0x20
#define _DAC2EN                 0x80

//==============================================================================

extern __at(0x0592) __sfr DAC2CON1;
extern __at(0x0592) __sfr DAC2REF;

//==============================================================================
//        DAC3CON0 Bits

extern __at(0x0593) __sfr DAC3CON0;

typedef struct
  {
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned DAC3OE2              : 1;
  unsigned DAC3OE1              : 1;
  unsigned                      : 1;
  unsigned DAC3EN               : 1;
  } __DAC3CON0bits_t;

extern __at(0x0593) volatile __DAC3CON0bits_t DAC3CON0bits;

#define _DAC3OE2                0x10
#define _DAC3OE1                0x20
#define _DAC3EN                 0x80

//==============================================================================

extern __at(0x0594) __sfr DAC3CON1;
extern __at(0x0594) __sfr DAC3REF;

//==============================================================================
//        DAC4CON0 Bits

extern __at(0x0595) __sfr DAC4CON0;

typedef struct
  {
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned DAC4OE2              : 1;
  unsigned DAC4OE1              : 1;
  unsigned                      : 1;
  unsigned DAC4EN               : 1;
  } __DAC4CON0bits_t;

extern __at(0x0595) volatile __DAC4CON0bits_t DAC4CON0bits;

#define _DAC4OE2                0x10
#define _DAC4OE1                0x20
#define _DAC4EN                 0x80

//==============================================================================

