OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1788.h
extern __at(0x0596) __sfr DAC4CON1;
extern __at(0x0596) __sfr DAC4REF;

//==============================================================================
//        PSMC1CON Bits

extern __at(0x0E91) __sfr PSMC1CON;

typedef union
  {
  struct
    {
    unsigned P1MODE0            : 1;
    unsigned P1MODE1            : 1;
    unsigned P1MODE2            : 1;
    unsigned P1MODE3            : 1;
    unsigned P1DBRE             : 1;
    unsigned P1DBFE             : 1;
    unsigned PSMC1LD            : 1;
    unsigned PSMC1EN            : 1;
    };

  struct
    {
    unsigned P1MODE             : 4;
    unsigned                    : 4;
    };
  } __PSMC1CONbits_t;

extern __at(0x0E91) volatile __PSMC1CONbits_t PSMC1CONbits;

#define _P1MODE0                0x01
#define _P1MODE1                0x02
#define _P1MODE2                0x04
#define _P1MODE3                0x08
#define _P1DBRE                 0x10
#define _P1DBFE                 0x20
#define _PSMC1LD                0x40
#define _PSMC1EN                0x80

//==============================================================================


//==============================================================================
//        PSMC1MDL Bits

extern __at(0x0E92) __sfr PSMC1MDL;

typedef union
  {
  struct
    {
    unsigned P1MSRC0            : 1;
    unsigned P1MSRC1            : 1;
    unsigned P1MSRC2            : 1;
    unsigned P1MSRC3            : 1;
    unsigned                    : 1;
    unsigned P1MDLBIT           : 1;
    unsigned P1MDLPOL           : 1;
    unsigned P1MDLEN            : 1;
    };

  struct
    {
    unsigned P1MSRC             : 4;
    unsigned                    : 4;
    };
  } __PSMC1MDLbits_t;

extern __at(0x0E92) volatile __PSMC1MDLbits_t PSMC1MDLbits;

#define _P1MSRC0                0x01
#define _P1MSRC1                0x02
#define _P1MSRC2                0x04
#define _P1MSRC3                0x08
#define _P1MDLBIT               0x20
#define _P1MDLPOL               0x40
#define _P1MDLEN                0x80

//==============================================================================


//==============================================================================
//        PSMC1SYNC Bits

extern __at(0x0E93) __sfr PSMC1SYNC;

typedef union
  {
  struct
    {
    unsigned P1SYNC0            : 1;
    unsigned P1SYNC1            : 1;
    unsigned P1SYNC2            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned P1DCPOL            : 1;
    unsigned P1PRPOL            : 1;
    unsigned P1POFST            : 1;
    };

  struct
    {
    unsigned P1SYNC             : 3;
    unsigned                    : 5;
    };
  } __PSMC1SYNCbits_t;

extern __at(0x0E93) volatile __PSMC1SYNCbits_t PSMC1SYNCbits;

#define _P1SYNC0                0x01
#define _P1SYNC1                0x02
#define _P1SYNC2                0x04
#define _P1DCPOL                0x20
#define _P1PRPOL                0x40
#define _P1POFST                0x80

//==============================================================================


//==============================================================================
//        PSMC1CLK Bits

extern __at(0x0E94) __sfr PSMC1CLK;

typedef union
  {
  struct
    {
    unsigned P1CSRC0            : 1;
    unsigned P1CSRC1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned P1CPRE0            : 1;
    unsigned P1CPRE1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P1CSRC             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned P1CPRE             : 2;
    unsigned                    : 2;
    };
  } __PSMC1CLKbits_t;

extern __at(0x0E94) volatile __PSMC1CLKbits_t PSMC1CLKbits;

#define _P1CSRC0                0x01
#define _P1CSRC1                0x02
#define _P1CPRE0                0x10
#define _P1CPRE1                0x20

//==============================================================================


//==============================================================================
//        PSMC1OEN Bits

extern __at(0x0E95) __sfr PSMC1OEN;

typedef struct
  {
  unsigned P1OEA                : 1;
  unsigned P1OEB                : 1;
  unsigned P1OEC                : 1;
  unsigned P1OED                : 1;
  unsigned P1OEE                : 1;
  unsigned P1OEF                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PSMC1OENbits_t;

extern __at(0x0E95) volatile __PSMC1OENbits_t PSMC1OENbits;

#define _P1OEA                  0x01
#define _P1OEB                  0x02
#define _P1OEC                  0x04
#define _P1OED                  0x08
#define _P1OEE                  0x10
#define _P1OEF                  0x20

//==============================================================================


//==============================================================================
//        PSMC1POL Bits

extern __at(0x0E96) __sfr PSMC1POL;

typedef struct
  {
  unsigned P1POLA               : 1;
  unsigned P1POLB               : 1;
  unsigned P1POLC               : 1;
  unsigned P1POLD               : 1;
  unsigned P1POLE               : 1;
  unsigned P1POLF               : 1;
  unsigned P1INPOL              : 1;
  unsigned                      : 1;
  } __PSMC1POLbits_t;

extern __at(0x0E96) volatile __PSMC1POLbits_t PSMC1POLbits;

#define _P1POLA                 0x01
#define _P1POLB                 0x02
#define _P1POLC                 0x04
#define _P1POLD                 0x08
#define _P1POLE                 0x10
#define _P1POLF                 0x20
#define _P1INPOL                0x40

//==============================================================================


//==============================================================================
//        PSMC1BLNK Bits

extern __at(0x0E97) __sfr PSMC1BLNK;

typedef union
  {
  struct
    {
    unsigned P1REBM0            : 1;
    unsigned P1REBM1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned P1FEBM0            : 1;
    unsigned P1FEBM1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P1REBM             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned P1FEBM             : 2;
    unsigned                    : 2;
    };
  } __PSMC1BLNKbits_t;

extern __at(0x0E97) volatile __PSMC1BLNKbits_t PSMC1BLNKbits;

#define _P1REBM0                0x01
#define _P1REBM1                0x02
#define _P1FEBM0                0x10
#define _P1FEBM1                0x20

//==============================================================================


//==============================================================================
//        PSMC1REBS Bits

extern __at(0x0E98) __sfr PSMC1REBS;

typedef struct
  {
  unsigned                      : 1;
  unsigned P1REBSC1             : 1;
  unsigned P1REBSC2             : 1;
  unsigned P1REBSC3             : 1;
  unsigned P1REBSC4             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P1REBSIN             : 1;
  } __PSMC1REBSbits_t;

extern __at(0x0E98) volatile __PSMC1REBSbits_t PSMC1REBSbits;

