OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1788.h
#define _P1REBSC1               0x02
#define _P1REBSC2               0x04
#define _P1REBSC3               0x08
#define _P1REBSC4               0x10
#define _P1REBSIN               0x80

//==============================================================================


//==============================================================================
//        PSMC1FEBS Bits

extern __at(0x0E99) __sfr PSMC1FEBS;

typedef struct
  {
  unsigned                      : 1;
  unsigned P1FEBSC1             : 1;
  unsigned P1FEBSC2             : 1;
  unsigned P1FEBSC3             : 1;
  unsigned P1FEBSC4             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P1FEBSIN             : 1;
  } __PSMC1FEBSbits_t;

extern __at(0x0E99) volatile __PSMC1FEBSbits_t PSMC1FEBSbits;

#define _P1FEBSC1               0x02
#define _P1FEBSC2               0x04
#define _P1FEBSC3               0x08
#define _P1FEBSC4               0x10
#define _P1FEBSIN               0x80

//==============================================================================


//==============================================================================
//        PSMC1PHS Bits

extern __at(0x0E9A) __sfr PSMC1PHS;

typedef struct
  {
  unsigned P1PHST               : 1;
  unsigned P1PHSC1              : 1;
  unsigned P1PHSC2              : 1;
  unsigned P1PHSC3              : 1;
  unsigned P1PHSC4              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P1PHSIN              : 1;
  } __PSMC1PHSbits_t;

extern __at(0x0E9A) volatile __PSMC1PHSbits_t PSMC1PHSbits;

#define _P1PHST                 0x01
#define _P1PHSC1                0x02
#define _P1PHSC2                0x04
#define _P1PHSC3                0x08
#define _P1PHSC4                0x10
#define _P1PHSIN                0x80

//==============================================================================


//==============================================================================
//        PSMC1DCS Bits

extern __at(0x0E9B) __sfr PSMC1DCS;

typedef struct
  {
  unsigned P1DCST               : 1;
  unsigned P1DCSC1              : 1;
  unsigned P1DCSC2              : 1;
  unsigned P1DCSC3              : 1;
  unsigned P1DCSC4              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P1DCSIN              : 1;
  } __PSMC1DCSbits_t;

extern __at(0x0E9B) volatile __PSMC1DCSbits_t PSMC1DCSbits;

#define _P1DCST                 0x01
#define _P1DCSC1                0x02
#define _P1DCSC2                0x04
#define _P1DCSC3                0x08
#define _P1DCSC4                0x10
#define _P1DCSIN                0x80

//==============================================================================


//==============================================================================
//        PSMC1PRS Bits

extern __at(0x0E9C) __sfr PSMC1PRS;

typedef struct
  {
  unsigned P1PRST               : 1;
  unsigned P1PRSC1              : 1;
  unsigned P1PRSC2              : 1;
  unsigned P1PRSC3              : 1;
  unsigned P1PRSC4              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P1PRSIN              : 1;
  } __PSMC1PRSbits_t;

extern __at(0x0E9C) volatile __PSMC1PRSbits_t PSMC1PRSbits;

#define _P1PRST                 0x01
#define _P1PRSC1                0x02
#define _P1PRSC2                0x04
#define _P1PRSC3                0x08
#define _P1PRSC4                0x10
#define _P1PRSIN                0x80

//==============================================================================


//==============================================================================
//        PSMC1ASDC Bits

extern __at(0x0E9D) __sfr PSMC1ASDC;

typedef struct
  {
  unsigned P1ASDOV              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P1ARSEN              : 1;
  unsigned P1ASDEN              : 1;
  unsigned P1ASE                : 1;
  } __PSMC1ASDCbits_t;

extern __at(0x0E9D) volatile __PSMC1ASDCbits_t PSMC1ASDCbits;

#define _P1ASDOV                0x01
#define _P1ARSEN                0x20
#define _P1ASDEN                0x40
#define _P1ASE                  0x80

//==============================================================================


//==============================================================================
//        PSMC1ASDL Bits

extern __at(0x0E9E) __sfr PSMC1ASDL;

typedef struct
  {
  unsigned P1ASDLA              : 1;
  unsigned P1ASDLB              : 1;
  unsigned P1ASDLC              : 1;
  unsigned P1ASDLD              : 1;
  unsigned P1ASDLE              : 1;
  unsigned P1ASDLF              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PSMC1ASDLbits_t;

extern __at(0x0E9E) volatile __PSMC1ASDLbits_t PSMC1ASDLbits;

#define _P1ASDLA                0x01
#define _P1ASDLB                0x02
#define _P1ASDLC                0x04
#define _P1ASDLD                0x08
#define _P1ASDLE                0x10
#define _P1ASDLF                0x20

//==============================================================================


//==============================================================================
//        PSMC1ASDS Bits

extern __at(0x0E9F) __sfr PSMC1ASDS;

typedef struct
  {
  unsigned                      : 1;
  unsigned P1ASDSC1             : 1;
  unsigned P1ASDSC2             : 1;
  unsigned P1ASDSC3             : 1;
  unsigned P1ASDSC4             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P1ASDSIN             : 1;
  } __PSMC1ASDSbits_t;

extern __at(0x0E9F) volatile __PSMC1ASDSbits_t PSMC1ASDSbits;

#define _P1ASDSC1               0x02
#define _P1ASDSC2               0x04
#define _P1ASDSC3               0x08
#define _P1ASDSC4               0x10
#define _P1ASDSIN               0x80

//==============================================================================


//==============================================================================
//        PSMC1INT Bits

