OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1788.h
extern __at(0x0ED2) volatile __PSMC3MDLbits_t PSMC3MDLbits;

#define _P3MSRC0                0x01
#define _P3MSRC1                0x02
#define _P3MSRC2                0x04
#define _P3MSRC3                0x08
#define _P3MDLBIT               0x20
#define _P3MDLPOL               0x40
#define _P3MDLEN                0x80

//==============================================================================


//==============================================================================
//        PSMC3SYNC Bits

extern __at(0x0ED3) __sfr PSMC3SYNC;

typedef union
  {
  struct
    {
    unsigned P3SYNC0            : 1;
    unsigned P3SYNC1            : 1;
    unsigned P3SYNC2            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned P3DCPOL            : 1;
    unsigned P3PRPOL            : 1;
    unsigned P3POFST            : 1;
    };

  struct
    {
    unsigned P3SYNC             : 3;
    unsigned                    : 5;
    };
  } __PSMC3SYNCbits_t;

extern __at(0x0ED3) volatile __PSMC3SYNCbits_t PSMC3SYNCbits;

#define _P3SYNC0                0x01
#define _P3SYNC1                0x02
#define _P3SYNC2                0x04
#define _P3DCPOL                0x20
#define _P3PRPOL                0x40
#define _P3POFST                0x80

//==============================================================================


//==============================================================================
//        PSMC3CLK Bits

extern __at(0x0ED4) __sfr PSMC3CLK;

typedef union
  {
  struct
    {
    unsigned P3CSRC0            : 1;
    unsigned P3CSRC1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned P3CPRE0            : 1;
    unsigned P3CPRE1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P3CSRC             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned P3CPRE             : 2;
    unsigned                    : 2;
    };
  } __PSMC3CLKbits_t;

extern __at(0x0ED4) volatile __PSMC3CLKbits_t PSMC3CLKbits;

#define _P3CSRC0                0x01
#define _P3CSRC1                0x02
#define _P3CPRE0                0x10
#define _P3CPRE1                0x20

//==============================================================================


//==============================================================================
//        PSMC3OEN Bits

extern __at(0x0ED5) __sfr PSMC3OEN;

typedef struct
  {
  unsigned P3OEA                : 1;
  unsigned P3OEB                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PSMC3OENbits_t;

extern __at(0x0ED5) volatile __PSMC3OENbits_t PSMC3OENbits;

#define _P3OEA                  0x01
#define _P3OEB                  0x02

//==============================================================================


//==============================================================================
//        PSMC3POL Bits

extern __at(0x0ED6) __sfr PSMC3POL;

typedef struct
  {
  unsigned P3POLA               : 1;
  unsigned P3POLB               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P3INPOL              : 1;
  unsigned                      : 1;
  } __PSMC3POLbits_t;

extern __at(0x0ED6) volatile __PSMC3POLbits_t PSMC3POLbits;

#define _P3POLA                 0x01
#define _P3POLB                 0x02
#define _P3INPOL                0x40

//==============================================================================


//==============================================================================
//        PSMC3BLNK Bits

extern __at(0x0ED7) __sfr PSMC3BLNK;

typedef union
  {
  struct
    {
    unsigned P3REBM0            : 1;
    unsigned P3REBM1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned P3FEBM0            : 1;
    unsigned P3FEBM1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P3REBM             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned P3FEBM             : 2;
    unsigned                    : 2;
    };
  } __PSMC3BLNKbits_t;

extern __at(0x0ED7) volatile __PSMC3BLNKbits_t PSMC3BLNKbits;

#define _P3REBM0                0x01
#define _P3REBM1                0x02
#define _P3FEBM0                0x10
#define _P3FEBM1                0x20

//==============================================================================


//==============================================================================
//        PSMC3REBS Bits

extern __at(0x0ED8) __sfr PSMC3REBS;

typedef struct
  {
  unsigned                      : 1;
  unsigned P3REBSC1             : 1;
  unsigned P3REBSC2             : 1;
  unsigned P3REBSC3             : 1;
  unsigned P3REBSC4             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P3REBSIN             : 1;
  } __PSMC3REBSbits_t;

extern __at(0x0ED8) volatile __PSMC3REBSbits_t PSMC3REBSbits;

#define _P3REBSC1               0x02
#define _P3REBSC2               0x04
#define _P3REBSC3               0x08
#define _P3REBSC4               0x10
#define _P3REBSIN               0x80

//==============================================================================


//==============================================================================
//        PSMC3FEBS Bits

extern __at(0x0ED9) __sfr PSMC3FEBS;

typedef struct
  {
  unsigned                      : 1;
  unsigned P3FEBSC1             : 1;
  unsigned P3FEBSC2             : 1;
  unsigned P3FEBSC3             : 1;
  unsigned P3FEBSC4             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P3FEBSIN             : 1;
  } __PSMC3FEBSbits_t;

extern __at(0x0ED9) volatile __PSMC3FEBSbits_t PSMC3FEBSbits;

#define _P3FEBSC1               0x02
#define _P3FEBSC2               0x04
#define _P3FEBSC3               0x08
#define _P3FEBSC4               0x10
#define _P3FEBSIN               0x80

//==============================================================================


//==============================================================================
//        PSMC3PHS Bits

extern __at(0x0EDA) __sfr PSMC3PHS;

typedef struct
  {
  unsigned P3PHST               : 1;
  unsigned P3PHSC1              : 1;
  unsigned P3PHSC2              : 1;
  unsigned P3PHSC3              : 1;
  unsigned P3PHSC4              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P3PHSIN              : 1;
  } __PSMC3PHSbits_t;

extern __at(0x0EDA) volatile __PSMC3PHSbits_t PSMC3PHSbits;

#define _P3PHST                 0x01
#define _P3PHSC1                0x02
#define _P3PHSC2                0x04
#define _P3PHSC3                0x08
#define _P3PHSC4                0x10
#define _P3PHSIN                0x80

//==============================================================================


//==============================================================================
//        PSMC3DCS Bits

