OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1788.h
#define P1PRST                  PSMC1PRSbits.P1PRST             // bit 0
#define P1PRSC1                 PSMC1PRSbits.P1PRSC1            // bit 1
#define P1PRSC2                 PSMC1PRSbits.P1PRSC2            // bit 2
#define P1PRSC3                 PSMC1PRSbits.P1PRSC3            // bit 3
#define P1PRSC4                 PSMC1PRSbits.P1PRSC4            // bit 4
#define P1PRSIN                 PSMC1PRSbits.P1PRSIN            // bit 7

#define P1REBSC1                PSMC1REBSbits.P1REBSC1          // bit 1
#define P1REBSC2                PSMC1REBSbits.P1REBSC2          // bit 2
#define P1REBSC3                PSMC1REBSbits.P1REBSC3          // bit 3
#define P1REBSC4                PSMC1REBSbits.P1REBSC4          // bit 4
#define P1REBSIN                PSMC1REBSbits.P1REBSIN          // bit 7

#define P1STRA                  PSMC1STR0bits.P1STRA            // bit 0
#define P1STRB                  PSMC1STR0bits.P1STRB            // bit 1
#define P1STRC                  PSMC1STR0bits.P1STRC            // bit 2
#define P1STRD                  PSMC1STR0bits.P1STRD            // bit 3
#define P1STRE                  PSMC1STR0bits.P1STRE            // bit 4
#define P1STRF                  PSMC1STR0bits.P1STRF            // bit 5

#define P1HSMEN                 PSMC1STR1bits.P1HSMEN           // bit 0
#define P1LSMEN                 PSMC1STR1bits.P1LSMEN           // bit 1
#define P1SSYNC                 PSMC1STR1bits.P1SSYNC           // bit 7

#define P1SYNC0                 PSMC1SYNCbits.P1SYNC0           // bit 0
#define P1SYNC1                 PSMC1SYNCbits.P1SYNC1           // bit 1
#define P1SYNC2                 PSMC1SYNCbits.P1SYNC2           // bit 2
#define P1DCPOL                 PSMC1SYNCbits.P1DCPOL           // bit 5
#define P1PRPOL                 PSMC1SYNCbits.P1PRPOL           // bit 6
#define P1POFST                 PSMC1SYNCbits.P1POFST           // bit 7

#define PSMC1TMR8               PSMC1TMRHbits.PSMC1TMR8         // bit 0
#define PSMC1TMR9               PSMC1TMRHbits.PSMC1TMR9         // bit 1
#define PSMC1TMR10              PSMC1TMRHbits.PSMC1TMR10        // bit 2
#define PSMC1TMR11              PSMC1TMRHbits.PSMC1TMR11        // bit 3
#define PSMC1TMR12              PSMC1TMRHbits.PSMC1TMR12        // bit 4
#define PSMC1TMR13              PSMC1TMRHbits.PSMC1TMR13        // bit 5
#define PSMC1TMR14              PSMC1TMRHbits.PSMC1TMR14        // bit 6
#define PSMC1TMR15              PSMC1TMRHbits.PSMC1TMR15        // bit 7

#define PSMC1TMR0               PSMC1TMRLbits.PSMC1TMR0         // bit 0
#define PSMC1TMR1               PSMC1TMRLbits.PSMC1TMR1         // bit 1
#define PSMC1TMR2               PSMC1TMRLbits.PSMC1TMR2         // bit 2
#define PSMC1TMR3               PSMC1TMRLbits.PSMC1TMR3         // bit 3
#define PSMC1TMR4               PSMC1TMRLbits.PSMC1TMR4         // bit 4
#define PSMC1TMR5               PSMC1TMRLbits.PSMC1TMR5         // bit 5
#define PSMC1TMR6               PSMC1TMRLbits.PSMC1TMR6         // bit 6
#define PSMC1TMR7               PSMC1TMRLbits.PSMC1TMR7         // bit 7

#define P2ASDOV                 PSMC2ASDCbits.P2ASDOV           // bit 0
#define P2ARSEN                 PSMC2ASDCbits.P2ARSEN           // bit 5
#define P2ASDEN                 PSMC2ASDCbits.P2ASDEN           // bit 6
#define P2ASE                   PSMC2ASDCbits.P2ASE             // bit 7

#define P2ASDLA                 PSMC2ASDLbits.P2ASDLA           // bit 0
#define P2ASDLB                 PSMC2ASDLbits.P2ASDLB           // bit 1

#define P2ASDSC1                PSMC2ASDSbits.P2ASDSC1          // bit 1
#define P2ASDSC2                PSMC2ASDSbits.P2ASDSC2          // bit 2
#define P2ASDSC3                PSMC2ASDSbits.P2ASDSC3          // bit 3
#define P2ASDSC4                PSMC2ASDSbits.P2ASDSC4          // bit 4
#define P2ASDSIN                PSMC2ASDSbits.P2ASDSIN          // bit 7

#define PSMC2BLKF0              PSMC2BLKFbits.PSMC2BLKF0        // bit 0
#define PSMC2BLKF1              PSMC2BLKFbits.PSMC2BLKF1        // bit 1
#define PSMC2BLKF2              PSMC2BLKFbits.PSMC2BLKF2        // bit 2
#define PSMC2BLKF3              PSMC2BLKFbits.PSMC2BLKF3        // bit 3
#define PSMC2BLKF4              PSMC2BLKFbits.PSMC2BLKF4        // bit 4
#define PSMC2BLKF5              PSMC2BLKFbits.PSMC2BLKF5        // bit 5
#define PSMC2BLKF6              PSMC2BLKFbits.PSMC2BLKF6        // bit 6
#define PSMC2BLKF7              PSMC2BLKFbits.PSMC2BLKF7        // bit 7

#define PSMC2BLKR0              PSMC2BLKRbits.PSMC2BLKR0        // bit 0
#define PSMC2BLKR1              PSMC2BLKRbits.PSMC2BLKR1        // bit 1
#define PSMC2BLKR2              PSMC2BLKRbits.PSMC2BLKR2        // bit 2
#define PSMC2BLKR3              PSMC2BLKRbits.PSMC2BLKR3        // bit 3
#define PSMC2BLKR4              PSMC2BLKRbits.PSMC2BLKR4        // bit 4
#define PSMC2BLKR5              PSMC2BLKRbits.PSMC2BLKR5        // bit 5
#define PSMC2BLKR6              PSMC2BLKRbits.PSMC2BLKR6        // bit 6
#define PSMC2BLKR7              PSMC2BLKRbits.PSMC2BLKR7        // bit 7

#define P2REBM0                 PSMC2BLNKbits.P2REBM0           // bit 0
#define P2REBM1                 PSMC2BLNKbits.P2REBM1           // bit 1
#define P2FEBM0                 PSMC2BLNKbits.P2FEBM0           // bit 4
#define P2FEBM1                 PSMC2BLNKbits.P2FEBM1           // bit 5

#define P2CSRC0                 PSMC2CLKbits.P2CSRC0            // bit 0
#define P2CSRC1                 PSMC2CLKbits.P2CSRC1            // bit 1
#define P2CPRE0                 PSMC2CLKbits.P2CPRE0            // bit 4
#define P2CPRE1                 PSMC2CLKbits.P2CPRE1            // bit 5

#define P2MODE0                 PSMC2CONbits.P2MODE0            // bit 0
#define P2MODE1                 PSMC2CONbits.P2MODE1            // bit 1
#define P2MODE2                 PSMC2CONbits.P2MODE2            // bit 2
#define P2MODE3                 PSMC2CONbits.P2MODE3            // bit 3
#define P2DBRE                  PSMC2CONbits.P2DBRE             // bit 4
#define P2DBFE                  PSMC2CONbits.P2DBFE             // bit 5
#define PSMC2LD                 PSMC2CONbits.PSMC2LD            // bit 6
#define PSMC2EN                 PSMC2CONbits.PSMC2EN            // bit 7

#define PSMC2DBF0               PSMC2DBFbits.PSMC2DBF0          // bit 0
#define PSMC2DBF1               PSMC2DBFbits.PSMC2DBF1          // bit 1
#define PSMC2DBF2               PSMC2DBFbits.PSMC2DBF2          // bit 2
#define PSMC2DBF3               PSMC2DBFbits.PSMC2DBF3          // bit 3
#define PSMC2DBF4               PSMC2DBFbits.PSMC2DBF4          // bit 4
#define PSMC2DBF5               PSMC2DBFbits.PSMC2DBF5          // bit 5
#define PSMC2DBF6               PSMC2DBFbits.PSMC2DBF6          // bit 6
#define PSMC2DBF7               PSMC2DBFbits.PSMC2DBF7          // bit 7

#define PSMC2DBR0               PSMC2DBRbits.PSMC2DBR0          // bit 0
#define PSMC2DBR1               PSMC2DBRbits.PSMC2DBR1          // bit 1
#define PSMC2DBR2               PSMC2DBRbits.PSMC2DBR2          // bit 2
#define PSMC2DBR3               PSMC2DBRbits.PSMC2DBR3          // bit 3
#define PSMC2DBR4               PSMC2DBRbits.PSMC2DBR4          // bit 4
#define PSMC2DBR5               PSMC2DBRbits.PSMC2DBR5          // bit 5
#define PSMC2DBR6               PSMC2DBRbits.PSMC2DBR6          // bit 6
#define PSMC2DBR7               PSMC2DBRbits.PSMC2DBR7          // bit 7

