OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1788.h
#define PSMC2DC8                PSMC2DCHbits.PSMC2DC8           // bit 0
#define PSMC2DC9                PSMC2DCHbits.PSMC2DC9           // bit 1
#define PSMC2DC10               PSMC2DCHbits.PSMC2DC10          // bit 2
#define PSMC2DC11               PSMC2DCHbits.PSMC2DC11          // bit 3
#define PSMC2DC12               PSMC2DCHbits.PSMC2DC12          // bit 4
#define PSMC2DC13               PSMC2DCHbits.PSMC2DC13          // bit 5
#define PSMC2DC14               PSMC2DCHbits.PSMC2DC14          // bit 6
#define PSMC2DC15               PSMC2DCHbits.PSMC2DC15          // bit 7

#define PSMC2DC0                PSMC2DCLbits.PSMC2DC0           // bit 0
#define PSMC2DC1                PSMC2DCLbits.PSMC2DC1           // bit 1
#define PSMC2DC2                PSMC2DCLbits.PSMC2DC2           // bit 2
#define PSMC2DC3                PSMC2DCLbits.PSMC2DC3           // bit 3
#define PSMC2DC4                PSMC2DCLbits.PSMC2DC4           // bit 4
#define PSMC2DC5                PSMC2DCLbits.PSMC2DC5           // bit 5
#define PSMC2DC6                PSMC2DCLbits.PSMC2DC6           // bit 6
#define PSMC2DC7                PSMC2DCLbits.PSMC2DC7           // bit 7

#define P2DCST                  PSMC2DCSbits.P2DCST             // bit 0
#define P2DCSC1                 PSMC2DCSbits.P2DCSC1            // bit 1
#define P2DCSC2                 PSMC2DCSbits.P2DCSC2            // bit 2
#define P2DCSC3                 PSMC2DCSbits.P2DCSC3            // bit 3
#define P2DCSC4                 PSMC2DCSbits.P2DCSC4            // bit 4
#define P2DCSIN                 PSMC2DCSbits.P2DCSIN            // bit 7

#define P2FEBSC1                PSMC2FEBSbits.P2FEBSC1          // bit 1
#define P2FEBSC2                PSMC2FEBSbits.P2FEBSC2          // bit 2
#define P2FEBSC3                PSMC2FEBSbits.P2FEBSC3          // bit 3
#define P2FEBSC4                PSMC2FEBSbits.P2FEBSC4          // bit 4
#define P2FEBSIN                PSMC2FEBSbits.P2FEBSIN          // bit 7

#define PSMC2FFA0               PSMC2FFAbits.PSMC2FFA0          // bit 0
#define PSMC2FFA1               PSMC2FFAbits.PSMC2FFA1          // bit 1
#define PSMC2FFA2               PSMC2FFAbits.PSMC2FFA2          // bit 2
#define PSMC2FFA3               PSMC2FFAbits.PSMC2FFA3          // bit 3

#define P2TPRIF                 PSMC2INTbits.P2TPRIF            // bit 0
#define P2TDCIF                 PSMC2INTbits.P2TDCIF            // bit 1
#define P2TPHIF                 PSMC2INTbits.P2TPHIF            // bit 2
#define P2TOVIF                 PSMC2INTbits.P2TOVIF            // bit 3
#define P2TPRIE                 PSMC2INTbits.P2TPRIE            // bit 4
#define P2TDCIE                 PSMC2INTbits.P2TDCIE            // bit 5
#define P2TPHIE                 PSMC2INTbits.P2TPHIE            // bit 6
#define P2TOVIE                 PSMC2INTbits.P2TOVIE            // bit 7

#define P2MSRC0                 PSMC2MDLbits.P2MSRC0            // bit 0
#define P2MSRC1                 PSMC2MDLbits.P2MSRC1            // bit 1
#define P2MSRC2                 PSMC2MDLbits.P2MSRC2            // bit 2
#define P2MSRC3                 PSMC2MDLbits.P2MSRC3            // bit 3
#define P2MDLBIT                PSMC2MDLbits.P2MDLBIT           // bit 5
#define P2MDLPOL                PSMC2MDLbits.P2MDLPOL           // bit 6
#define P2MDLEN                 PSMC2MDLbits.P2MDLEN            // bit 7

#define P2OEA                   PSMC2OENbits.P2OEA              // bit 0
#define P2OEB                   PSMC2OENbits.P2OEB              // bit 1

#define PSMC2PH8                PSMC2PHHbits.PSMC2PH8           // bit 0
#define PSMC2PH9                PSMC2PHHbits.PSMC2PH9           // bit 1
#define PSMC2PH10               PSMC2PHHbits.PSMC2PH10          // bit 2
#define PSMC2PH11               PSMC2PHHbits.PSMC2PH11          // bit 3
#define PSMC2PH12               PSMC2PHHbits.PSMC2PH12          // bit 4
#define PSMC2PH13               PSMC2PHHbits.PSMC2PH13          // bit 5
#define PSMC2PH14               PSMC2PHHbits.PSMC2PH14          // bit 6
#define PSMC2PH15               PSMC2PHHbits.PSMC2PH15          // bit 7

#define PSMC2PH0                PSMC2PHLbits.PSMC2PH0           // bit 0
#define PSMC2PH1                PSMC2PHLbits.PSMC2PH1           // bit 1
#define PSMC2PH2                PSMC2PHLbits.PSMC2PH2           // bit 2
#define PSMC2PH3                PSMC2PHLbits.PSMC2PH3           // bit 3
#define PSMC2PH4                PSMC2PHLbits.PSMC2PH4           // bit 4
#define PSMC2PH5                PSMC2PHLbits.PSMC2PH5           // bit 5
#define PSMC2PH6                PSMC2PHLbits.PSMC2PH6           // bit 6
#define PSMC2PH7                PSMC2PHLbits.PSMC2PH7           // bit 7

#define P2PHST                  PSMC2PHSbits.P2PHST             // bit 0
#define P2PHSC1                 PSMC2PHSbits.P2PHSC1            // bit 1
#define P2PHSC2                 PSMC2PHSbits.P2PHSC2            // bit 2
#define P2PHSC3                 PSMC2PHSbits.P2PHSC3            // bit 3
#define P2PHSC4                 PSMC2PHSbits.P2PHSC4            // bit 4
#define P2PHSIN                 PSMC2PHSbits.P2PHSIN            // bit 7

#define P2POLA                  PSMC2POLbits.P2POLA             // bit 0
#define P2POLB                  PSMC2POLbits.P2POLB             // bit 1
#define P2INPOL                 PSMC2POLbits.P2INPOL            // bit 6

#define PSMC2PR8                PSMC2PRHbits.PSMC2PR8           // bit 0
#define PSMC2PR9                PSMC2PRHbits.PSMC2PR9           // bit 1
#define PSMC2PR10               PSMC2PRHbits.PSMC2PR10          // bit 2
#define PSMC2PR11               PSMC2PRHbits.PSMC2PR11          // bit 3
#define PSMC2PR12               PSMC2PRHbits.PSMC2PR12          // bit 4
#define PSMC2PR13               PSMC2PRHbits.PSMC2PR13          // bit 5
#define PSMC2PR14               PSMC2PRHbits.PSMC2PR14          // bit 6
#define PSMC2PR15               PSMC2PRHbits.PSMC2PR15          // bit 7

#define PSMC2PR0                PSMC2PRLbits.PSMC2PR0           // bit 0
#define PSMC2PR1                PSMC2PRLbits.PSMC2PR1           // bit 1
#define PSMC2PR2                PSMC2PRLbits.PSMC2PR2           // bit 2
#define PSMC2PR3                PSMC2PRLbits.PSMC2PR3           // bit 3
#define PSMC2PR4                PSMC2PRLbits.PSMC2PR4           // bit 4
#define PSMC2PR5                PSMC2PRLbits.PSMC2PR5           // bit 5
#define PSMC2PR6                PSMC2PRLbits.PSMC2PR6           // bit 6
#define PSMC2PR7                PSMC2PRLbits.PSMC2PR7           // bit 7

#define P2PRST                  PSMC2PRSbits.P2PRST             // bit 0
#define P2PRSC1                 PSMC2PRSbits.P2PRSC1            // bit 1
#define P2PRSC2                 PSMC2PRSbits.P2PRSC2            // bit 2
#define P2PRSC3                 PSMC2PRSbits.P2PRSC3            // bit 3
#define P2PRSC4                 PSMC2PRSbits.P2PRSC4            // bit 4
#define P2PRSIN                 PSMC2PRSbits.P2PRSIN            // bit 7

