OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1788.h
#define P2REBSC1                PSMC2REBSbits.P2REBSC1          // bit 1
#define P2REBSC2                PSMC2REBSbits.P2REBSC2          // bit 2
#define P2REBSC3                PSMC2REBSbits.P2REBSC3          // bit 3
#define P2REBSC4                PSMC2REBSbits.P2REBSC4          // bit 4
#define P2REBSIN                PSMC2REBSbits.P2REBSIN          // bit 7

#define P2STRA                  PSMC2STR0bits.P2STRA            // bit 0
#define P2STRB                  PSMC2STR0bits.P2STRB            // bit 1

#define P2HSMEN                 PSMC2STR1bits.P2HSMEN           // bit 0
#define P2LSMEN                 PSMC2STR1bits.P2LSMEN           // bit 1
#define P2SSYNC                 PSMC2STR1bits.P2SSYNC           // bit 7

#define P2SYNC0                 PSMC2SYNCbits.P2SYNC0           // bit 0
#define P2SYNC1                 PSMC2SYNCbits.P2SYNC1           // bit 1
#define P2SYNC2                 PSMC2SYNCbits.P2SYNC2           // bit 2
#define P2DCPOL                 PSMC2SYNCbits.P2DCPOL           // bit 5
#define P2PRPOL                 PSMC2SYNCbits.P2PRPOL           // bit 6
#define P2POFST                 PSMC2SYNCbits.P2POFST           // bit 7

#define PSMC2TMR8               PSMC2TMRHbits.PSMC2TMR8         // bit 0
#define PSMC2TMR9               PSMC2TMRHbits.PSMC2TMR9         // bit 1
#define PSMC2TMR10              PSMC2TMRHbits.PSMC2TMR10        // bit 2
#define PSMC2TMR11              PSMC2TMRHbits.PSMC2TMR11        // bit 3
#define PSMC2TMR12              PSMC2TMRHbits.PSMC2TMR12        // bit 4
#define PSMC2TMR13              PSMC2TMRHbits.PSMC2TMR13        // bit 5
#define PSMC2TMR14              PSMC2TMRHbits.PSMC2TMR14        // bit 6
#define PSMC2TMR15              PSMC2TMRHbits.PSMC2TMR15        // bit 7

#define PSMC2TMR0               PSMC2TMRLbits.PSMC2TMR0         // bit 0
#define PSMC2TMR1               PSMC2TMRLbits.PSMC2TMR1         // bit 1
#define PSMC2TMR2               PSMC2TMRLbits.PSMC2TMR2         // bit 2
#define PSMC2TMR3               PSMC2TMRLbits.PSMC2TMR3         // bit 3
#define PSMC2TMR4               PSMC2TMRLbits.PSMC2TMR4         // bit 4
#define PSMC2TMR5               PSMC2TMRLbits.PSMC2TMR5         // bit 5
#define PSMC2TMR6               PSMC2TMRLbits.PSMC2TMR6         // bit 6
#define PSMC2TMR7               PSMC2TMRLbits.PSMC2TMR7         // bit 7

#define P3ASDOV                 PSMC3ASDCbits.P3ASDOV           // bit 0
#define P3ARSEN                 PSMC3ASDCbits.P3ARSEN           // bit 5
#define P3ASDEN                 PSMC3ASDCbits.P3ASDEN           // bit 6
#define P3ASE                   PSMC3ASDCbits.P3ASE             // bit 7

#define P3ASDLA                 PSMC3ASDLbits.P3ASDLA           // bit 0
#define P3ASDLB                 PSMC3ASDLbits.P3ASDLB           // bit 1

#define P3ASDSC1                PSMC3ASDSbits.P3ASDSC1          // bit 1
#define P3ASDSC2                PSMC3ASDSbits.P3ASDSC2          // bit 2
#define P3ASDSC3                PSMC3ASDSbits.P3ASDSC3          // bit 3
#define P3ASDSC4                PSMC3ASDSbits.P3ASDSC4          // bit 4
#define P3ASDSIN                PSMC3ASDSbits.P3ASDSIN          // bit 7

#define PSMC3BLKF0              PSMC3BLKFbits.PSMC3BLKF0        // bit 0
#define PSMC3BLKF1              PSMC3BLKFbits.PSMC3BLKF1        // bit 1
#define PSMC3BLKF2              PSMC3BLKFbits.PSMC3BLKF2        // bit 2
#define PSMC3BLKF3              PSMC3BLKFbits.PSMC3BLKF3        // bit 3
#define PSMC3BLKF4              PSMC3BLKFbits.PSMC3BLKF4        // bit 4
#define PSMC3BLKF5              PSMC3BLKFbits.PSMC3BLKF5        // bit 5
#define PSMC3BLKF6              PSMC3BLKFbits.PSMC3BLKF6        // bit 6
#define PSMC3BLKF7              PSMC3BLKFbits.PSMC3BLKF7        // bit 7

#define PSMC3BLKR0              PSMC3BLKRbits.PSMC3BLKR0        // bit 0
#define PSMC3BLKR1              PSMC3BLKRbits.PSMC3BLKR1        // bit 1
#define PSMC3BLKR2              PSMC3BLKRbits.PSMC3BLKR2        // bit 2
#define PSMC3BLKR3              PSMC3BLKRbits.PSMC3BLKR3        // bit 3
#define PSMC3BLKR4              PSMC3BLKRbits.PSMC3BLKR4        // bit 4
#define PSMC3BLKR5              PSMC3BLKRbits.PSMC3BLKR5        // bit 5
#define PSMC3BLKR6              PSMC3BLKRbits.PSMC3BLKR6        // bit 6
#define PSMC3BLKR7              PSMC3BLKRbits.PSMC3BLKR7        // bit 7

#define P3REBM0                 PSMC3BLNKbits.P3REBM0           // bit 0
#define P3REBM1                 PSMC3BLNKbits.P3REBM1           // bit 1
#define P3FEBM0                 PSMC3BLNKbits.P3FEBM0           // bit 4
#define P3FEBM1                 PSMC3BLNKbits.P3FEBM1           // bit 5

#define P3CSRC0                 PSMC3CLKbits.P3CSRC0            // bit 0
#define P3CSRC1                 PSMC3CLKbits.P3CSRC1            // bit 1
#define P3CPRE0                 PSMC3CLKbits.P3CPRE0            // bit 4
#define P3CPRE1                 PSMC3CLKbits.P3CPRE1            // bit 5

#define P3MODE0                 PSMC3CONbits.P3MODE0            // bit 0
#define P3MODE1                 PSMC3CONbits.P3MODE1            // bit 1
#define P3MODE2                 PSMC3CONbits.P3MODE2            // bit 2
#define P3MODE3                 PSMC3CONbits.P3MODE3            // bit 3
#define P3DBRE                  PSMC3CONbits.P3DBRE             // bit 4
#define P3DBFE                  PSMC3CONbits.P3DBFE             // bit 5
#define PSMC3LD                 PSMC3CONbits.PSMC3LD            // bit 6
#define PSMC3EN                 PSMC3CONbits.PSMC3EN            // bit 7

#define PSMC3DBF0               PSMC3DBFbits.PSMC3DBF0          // bit 0
#define PSMC3DBF1               PSMC3DBFbits.PSMC3DBF1          // bit 1
#define PSMC3DBF2               PSMC3DBFbits.PSMC3DBF2          // bit 2
#define PSMC3DBF3               PSMC3DBFbits.PSMC3DBF3          // bit 3
#define PSMC3DBF4               PSMC3DBFbits.PSMC3DBF4          // bit 4
#define PSMC3DBF5               PSMC3DBFbits.PSMC3DBF5          // bit 5
#define PSMC3DBF6               PSMC3DBFbits.PSMC3DBF6          // bit 6
#define PSMC3DBF7               PSMC3DBFbits.PSMC3DBF7          // bit 7

#define PSMC3DBR0               PSMC3DBRbits.PSMC3DBR0          // bit 0
#define PSMC3DBR1               PSMC3DBRbits.PSMC3DBR1          // bit 1
#define PSMC3DBR2               PSMC3DBRbits.PSMC3DBR2          // bit 2
#define PSMC3DBR3               PSMC3DBRbits.PSMC3DBR3          // bit 3
#define PSMC3DBR4               PSMC3DBRbits.PSMC3DBR4          // bit 4
#define PSMC3DBR5               PSMC3DBRbits.PSMC3DBR5          // bit 5
#define PSMC3DBR6               PSMC3DBRbits.PSMC3DBR6          // bit 6
#define PSMC3DBR7               PSMC3DBRbits.PSMC3DBR7          // bit 7

#define PSMC3DC8                PSMC3DCHbits.PSMC3DC8           // bit 0
#define PSMC3DC9                PSMC3DCHbits.PSMC3DC9           // bit 1
#define PSMC3DC10               PSMC3DCHbits.PSMC3DC10          // bit 2
#define PSMC3DC11               PSMC3DCHbits.PSMC3DC11          // bit 3
#define PSMC3DC12               PSMC3DCHbits.PSMC3DC12          // bit 4
#define PSMC3DC13               PSMC3DCHbits.PSMC3DC13          // bit 5
#define PSMC3DC14               PSMC3DCHbits.PSMC3DC14          // bit 6
#define PSMC3DC15               PSMC3DCHbits.PSMC3DC15          // bit 7

