OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1788.h
#define PSMC3TMR0               PSMC3TMRLbits.PSMC3TMR0         // bit 0
#define PSMC3TMR1               PSMC3TMRLbits.PSMC3TMR1         // bit 1
#define PSMC3TMR2               PSMC3TMRLbits.PSMC3TMR2         // bit 2
#define PSMC3TMR3               PSMC3TMRLbits.PSMC3TMR3         // bit 3
#define PSMC3TMR4               PSMC3TMRLbits.PSMC3TMR4         // bit 4
#define PSMC3TMR5               PSMC3TMRLbits.PSMC3TMR5         // bit 5
#define PSMC3TMR6               PSMC3TMRLbits.PSMC3TMR6         // bit 6
#define PSMC3TMR7               PSMC3TMRLbits.PSMC3TMR7         // bit 7

#define P4ASDOV                 PSMC4ASDCbits.P4ASDOV           // bit 0
#define P4ARSEN                 PSMC4ASDCbits.P4ARSEN           // bit 5
#define P4ASDEN                 PSMC4ASDCbits.P4ASDEN           // bit 6
#define P4ASE                   PSMC4ASDCbits.P4ASE             // bit 7

#define P4ASDLA                 PSMC4ASDLbits.P4ASDLA           // bit 0
#define P4ASDLB                 PSMC4ASDLbits.P4ASDLB           // bit 1

#define P4ASDSC1                PSMC4ASDSbits.P4ASDSC1          // bit 1
#define P4ASDSC2                PSMC4ASDSbits.P4ASDSC2          // bit 2
#define P4ASDSC3                PSMC4ASDSbits.P4ASDSC3          // bit 3
#define P4ASDSC4                PSMC4ASDSbits.P4ASDSC4          // bit 4
#define P4ASDSIN                PSMC4ASDSbits.P4ASDSIN          // bit 7

#define PSMC4BLKF0              PSMC4BLKFbits.PSMC4BLKF0        // bit 0
#define PSMC4BLKF1              PSMC4BLKFbits.PSMC4BLKF1        // bit 1
#define PSMC4BLKF2              PSMC4BLKFbits.PSMC4BLKF2        // bit 2
#define PSMC4BLKF3              PSMC4BLKFbits.PSMC4BLKF3        // bit 3
#define PSMC4BLKF4              PSMC4BLKFbits.PSMC4BLKF4        // bit 4
#define PSMC4BLKF5              PSMC4BLKFbits.PSMC4BLKF5        // bit 5
#define PSMC4BLKF6              PSMC4BLKFbits.PSMC4BLKF6        // bit 6
#define PSMC4BLKF7              PSMC4BLKFbits.PSMC4BLKF7        // bit 7

#define PSMC4BLKR0              PSMC4BLKRbits.PSMC4BLKR0        // bit 0
#define PSMC4BLKR1              PSMC4BLKRbits.PSMC4BLKR1        // bit 1
#define PSMC4BLKR2              PSMC4BLKRbits.PSMC4BLKR2        // bit 2
#define PSMC4BLKR3              PSMC4BLKRbits.PSMC4BLKR3        // bit 3
#define PSMC4BLKR4              PSMC4BLKRbits.PSMC4BLKR4        // bit 4
#define PSMC4BLKR5              PSMC4BLKRbits.PSMC4BLKR5        // bit 5
#define PSMC4BLKR6              PSMC4BLKRbits.PSMC4BLKR6        // bit 6
#define PSMC4BLKR7              PSMC4BLKRbits.PSMC4BLKR7        // bit 7

#define P4REBM0                 PSMC4BLNKbits.P4REBM0           // bit 0
#define P4REBM1                 PSMC4BLNKbits.P4REBM1           // bit 1
#define P4FEBM0                 PSMC4BLNKbits.P4FEBM0           // bit 4
#define P4FEBM1                 PSMC4BLNKbits.P4FEBM1           // bit 5

#define P4CSRC0                 PSMC4CLKbits.P4CSRC0            // bit 0
#define P4CSRC1                 PSMC4CLKbits.P4CSRC1            // bit 1
#define P4CPRE0                 PSMC4CLKbits.P4CPRE0            // bit 4
#define P4CPRE1                 PSMC4CLKbits.P4CPRE1            // bit 5

#define P4MODE0                 PSMC4CONbits.P4MODE0            // bit 0
#define P4MODE1                 PSMC4CONbits.P4MODE1            // bit 1
#define P4MODE2                 PSMC4CONbits.P4MODE2            // bit 2
#define P4MODE3                 PSMC4CONbits.P4MODE3            // bit 3
#define P4DBRE                  PSMC4CONbits.P4DBRE             // bit 4
#define P4DBFE                  PSMC4CONbits.P4DBFE             // bit 5
#define PSMC4LD                 PSMC4CONbits.PSMC4LD            // bit 6
#define PSMC4EN                 PSMC4CONbits.PSMC4EN            // bit 7

#define PSMC4DBF0               PSMC4DBFbits.PSMC4DBF0          // bit 0
#define PSMC4DBF1               PSMC4DBFbits.PSMC4DBF1          // bit 1
#define PSMC4DBF2               PSMC4DBFbits.PSMC4DBF2          // bit 2
#define PSMC4DBF3               PSMC4DBFbits.PSMC4DBF3          // bit 3
#define PSMC4DBF4               PSMC4DBFbits.PSMC4DBF4          // bit 4
#define PSMC4DBF5               PSMC4DBFbits.PSMC4DBF5          // bit 5
#define PSMC4DBF6               PSMC4DBFbits.PSMC4DBF6          // bit 6
#define PSMC4DBF7               PSMC4DBFbits.PSMC4DBF7          // bit 7

#define PSMC4DBR0               PSMC4DBRbits.PSMC4DBR0          // bit 0
#define PSMC4DBR1               PSMC4DBRbits.PSMC4DBR1          // bit 1
#define PSMC4DBR2               PSMC4DBRbits.PSMC4DBR2          // bit 2
#define PSMC4DBR3               PSMC4DBRbits.PSMC4DBR3          // bit 3
#define PSMC4DBR4               PSMC4DBRbits.PSMC4DBR4          // bit 4
#define PSMC4DBR5               PSMC4DBRbits.PSMC4DBR5          // bit 5
#define PSMC4DBR6               PSMC4DBRbits.PSMC4DBR6          // bit 6
#define PSMC4DBR7               PSMC4DBRbits.PSMC4DBR7          // bit 7

#define PSMC4DC8                PSMC4DCHbits.PSMC4DC8           // bit 0
#define PSMC4DC9                PSMC4DCHbits.PSMC4DC9           // bit 1
#define PSMC4DC10               PSMC4DCHbits.PSMC4DC10          // bit 2
#define PSMC4DC11               PSMC4DCHbits.PSMC4DC11          // bit 3
#define PSMC4DC12               PSMC4DCHbits.PSMC4DC12          // bit 4
#define PSMC4DC13               PSMC4DCHbits.PSMC4DC13          // bit 5
#define PSMC4DC14               PSMC4DCHbits.PSMC4DC14          // bit 6
#define PSMC4DC15               PSMC4DCHbits.PSMC4DC15          // bit 7

#define PSMC4DC0                PSMC4DCLbits.PSMC4DC0           // bit 0
#define PSMC4DC1                PSMC4DCLbits.PSMC4DC1           // bit 1
#define PSMC4DC2                PSMC4DCLbits.PSMC4DC2           // bit 2
#define PSMC4DC3                PSMC4DCLbits.PSMC4DC3           // bit 3
#define PSMC4DC4                PSMC4DCLbits.PSMC4DC4           // bit 4
#define PSMC4DC5                PSMC4DCLbits.PSMC4DC5           // bit 5
#define PSMC4DC6                PSMC4DCLbits.PSMC4DC6           // bit 6
#define PSMC4DC7                PSMC4DCLbits.PSMC4DC7           // bit 7

#define P4DCST                  PSMC4DCSbits.P4DCST             // bit 0
#define P4DCSC1                 PSMC4DCSbits.P4DCSC1            // bit 1
#define P4DCSC2                 PSMC4DCSbits.P4DCSC2            // bit 2
#define P4DCSC3                 PSMC4DCSbits.P4DCSC3            // bit 3
#define P4DCSC4                 PSMC4DCSbits.P4DCSC4            // bit 4
#define P4DCSIN                 PSMC4DCSbits.P4DCSIN            // bit 7

